/* Фреймвокри позволяют создавать приложения прямо на нашем сайте
SPA single page application
пример google почта */

/* 1. Angular фреймворт просто готовый код который будет использоваться
нам нужно подстраиваться под работу фреймворка 
фреймворк - это советчик как именно созлдавать проект

-самый тяжелый фремворк 
-высокий порог вхождения
-активно развивается

Что надо чтобы учить Angular:
1. Node.js установить
2. Type Script
3. Web Pack
4. MVC pattert шаблон проектирования
5. Angular документация

Итог данный фреймворк создан для огромных проектов которые быстро разрастаются */


/* 2. VUE.js фреймворк 
-прост в обучении

Что нужно знать для VUE:
1. Web Pack
2. Vue документация
3. Node.js установить 
Итог быстро просто писать чистый код*/



/* Библиотеки */

/* 1. React библиотека мы подстраиваем её под своё работу
Что знать:
 1. JSX
 2. Babel Включено в React Create App
 3. Web Pack React Create App
 4. React документация
 5. Node.js установить
 Итог все можно настроить под себя и все работает на нативном JS*/

/* 2. jQuery библиотека
которую можно использвать всем
можно изучить за два дня
старый но часто встечается */



 /* Аналоги Java Script

 /* Type Script считается отдельным языком программирования который 
компилируется в java script */