 /* Вклададка source в меню разработкчика f12
позволяет на проверять код на лшибки создавая
brakepoints 

что бы установить breakpoint
мы просто кликаем на номер строки и она загорится зеленым
далее обновляем страницу и заметим что сайт остановил загрузку
и видим сообщение что Paused in debugger
 теперь чтобы попробовать запустить код мы должны нажать на кнопку
 точки и стрелка вправо Step over next function call
 она будет прыгать по всему коду
 */

 /* Такде если установить BreakPoint сразу в
  функции например на строке с return то мы сможем видить 
  какие изменения происходять с массивом
  можно сказать это аналог pythontutor
  */

  /* С помощью  source можно увидеть где какие ошибки есть в коде*/

  /* а спомощью debugger; который можно вставить в код можно
  остановить код в самом дебагере! */