/* Какое название переменной в JS является самым правильным?
 let personalData
 
 Какой из вариантов в результате даст строку в виде:
 
  'Helo' + ", " + name
  
  Какой результат мы получим в переменной result?
const result = getSum(5, 6);
const getSum = function(a, b) {
    return a + b;
    никаккой функция вызвана до объфвления
}*/
console.log(typeof(NaN));
/* number */
/* Какой результат команды?

typeof(+'4')
number */

/* Как называется прием из кода ниже?

const user = {
    name: 'Alex',
    age: 25
}
const {name, age} = user;

Деструктуризация*/

/* Что может находиться внутри массива как его элементы?
Любые сущности и типы данных */


/* Сколько аргументов может быть у функции?
сколько угодно */







/* Что делает метод slice, примененный на строке?
извлекает часть строки не изменяя оригинал */





/* Для чего нужна система контроля версий?

все выше перечисленное
для сохранения
для командной работы
для резервной копии*/








/* В чем отличие свойств от методов объектов?
Свойства это наличие данных строка число
Методы это функции которые записаны в объект */



/* Какой результат даст этот код?

0 || 1

0 && 1

"a" > "b"

0 || NaN || false || null


1
0
false
null*/









/* JavaScript - это...
прототипно ориентированный язык */






/* Конструкция switch позволяет...
объединить множество проверок и условий в удобном формате */







/* Что выведет в консоль данный код?

for (let i = 1; i < 5; i++) {
    console.log(i + 1)
}2 3 4 5 */






/* 
Что будет содержаться в переменной result после завершения кода?

function foo(a,b) {
    const [first] = a;
    const {eng} = b;
 
    return `${first} ${eng}`;
}
 
const result = foo(['Hello', 'Привет'], {ru: 'Мир', eng: 'World'})



'Hello World'*/








/* success alert
Good job!
Question 18:
Что будет содержаться в переменной time?

let time = '';
5 > 3 || 2 ? time = 'Day' : time = 'Night' 

Day*/