/* 
Ресурсы для оттачивания навыков программирования
Как вы уже заметили, у нас в курсе были и упражнения по написанию 
кода и решению простых или не очень задачек прямо на платформе. 
На них действительно можно хорошо набить руку, отточить навыки и 
логику мышления.

И в целом, я бы мог в курс поместить еще десятки таких задач из 
разряда "напишите функцию такую-то" и тп. Но у меня для вас есть 
предложение получше и полезнее.

Дело в том, что существуют специальные международные, бесплатные
 сервисы с такими задачами. С более удобным интерфейсом, но самое
  главное, с сохранением прогресса. Поверьте, если вы на собеседовании
   или в резюме укажите ваш профиль, в котором решены уже сотни задач
    самого разного уровня сложности - это будет большим плюсом. 
    Так вы докажите, что не просто "где-то" их решали, а покажите 
    реальный результат. С такими ресурсами я вам и предлагаю 
    ознакомиться.

Не волнуйтесь, по курсу мы будем еще очень много кодить, 
но в направлении реальной практики. А в перерыве вы можете решать такие абстрактные задачки, которые предоставляют сервисы:

https://www.codewars.com/ - международный сайт с поддержкой десятков
 языков программирования и задачек к ним. Задания разделены на уровни 
 сложности, их появляется все больше и больше. Удобный интерфейс 
 тестирования решений, проверки и сравнения с другими. И, конечно же,
  прокачка своего профиля по уровням. Рекомендую.

https://leetcode.com/ - похожий на предыдущий, но обычно уже с более
 сложными задачами. По моему опыту, тут больше упор на алгоритмы и их 
 применение. Но и JS можно отлично потренировать.
(Обычно этих двух хватает с головой, если честно)

https://www.hackerrank.com/ - все тоже похоже. Сервис больше популярен
 в США, но это не мешает и нам тут потренироваться.

freecodecamp - тут можно прорешать еще дополнительные задачки, если
 предыдущих мало 🙂

Но помните, что в какой-то момент вы поймете, что почти все эти задачки
 однотипны. И это действительно так. Так что зацикливаться и тратить
  недели на них точно не стоит. Это далеко не всегда то, что вы будете
   делать в своей реальной работе 🙂

И все же, я бы рекомендовал вернуться к этим сервисам чуть-чуть позже,
 когда мы изучим большую часть JavaScript. Будет куда проще. А дальше,
  если не считать необязательный модуль, мы будем уже работать с 
  реальным проектом в браузере и на нем познавать реальное 
  программирование.
 */