/* 
Про дополнительную информацию по основам
Как можно понять из названия этого модуля, здесь будет собрана
 информация, которая относится к базовой в JS, но пока необязательной.
  Знать её нужно, но особой практической пользы в самом начале вашего
   обучения вы от неё не получите.

Именно поэтому я могу посоветовать изучить эти уроки либо чуть позже 
(перед частью с react, например), либо особо не заострять на них свое
 внимание. Повторюсь, это все полезные базовые вещи, но сейчас вы с 
 ними можете не и столкнуться в практическом плане.

Но рассказать я вам о них обязан 🙂

А в конце модуля есть парочка интересных задачек, которые вы можете
 попробовать решить.
*/