/* live server это простой сервер */
/* когда мы пользуемся гуглом мы отправляем get запрос */
/* post запрос когда мы отправляем свою информацию на сервер
заполняем форму и т.д. сохранить на сервере */

/* open server mammp для macos */


/* mamp настройка папка htdocs сюда же мы будем кидать
нашу папку с проектом */

/* далее запускаем mamp и нажимаешь start servers
там нажимаем tools php my admin */

/* дальше прописываем в адресной строке адрес 
http://localhost/тут название сайта/ 
или заходим в настройки и там в графу MyFavorite LInk ставим / просто слэш
и всевот готово*/