/* Условные обозначения и материалы
Короткие обозначения в названиях уроков:
(д) - дополнительные уроки. Это либо более подробное объяснение, либо необязательный материал. Можно просмотреть в ускоренном режиме, позже или сразу промотать в конец для того, чтобы платформа засчитала.
(*) - необязательные задачи или уроки.
(**) - сложные и необязательные задачи или уроки.
❗️- сложные, но крайне желательные к просмотру уроки.
Все материалы и ссылки к урокам расположены в разделе "Ресурсы":
 
Секция вопросов, заметок и прочих полезных пунктов находится под роликом:


Кнопка для ускорения или замедления видео находится слева:
 
P.S. Интерфейс в мобильном приложении может отличаться



Установка программ
⦁	VScode
С помощью поиска можно найти и заменить разные классы!
остановился на Beatify
Плагины
⦁	 Import Cost (вес импортируемых файлов сразу покажет vs code)
⦁	 JavaScript (ES6) code snippets маленькие команды помогают быстрее создавать код
⦁	Ocenanic Next по выбору
⦁	vscode-styled-components
⦁	reactjs code snipets
⦁	eslint и jshint плагины для проверки правописания нужна настройка


Чем отличается редактор кода от IDE (интегрированная среда разработки)

node js lts*
npm
установить


НАСТРОЙКА JSHint
открываем наш терминал
npm install –g jshint 
чтобы jshint работал на нашем пк

далее добавляем в любом проекте файл .jshintrc (скачиваем из урока)
этот файл мы помещаем в нашу рабочую папку Projects где находяться все наши проекты
также можно этот файл положить локально в папку с проектом и тогда он будет работать только проекте



Про редакторы кода и учебники
Про редакторы кода, альтернативы
Как я уже сказал в предыдущем уроке, вы можете использовать абсолютно любой редактор кода или интерактивную среду, которая вам по душе. Никаких ограничений нет и на прохождение курса никак не влияет. Скорее всего у вас уже установлен один из редакторов и вы можете продолжать работу в нем. (Не устану повторять, что для прохождения курса уже нужны базовые знания верстки. Об этом есть в требованиях и в уроках выше)

Тут я приложу еще дополнительные варианты, которые пользуются популярностью и в будущем вы можете их рассмотреть как альтернативы. Если вы только начинаете свой путь в программировании - не стоит тратить на это много времени, а лучше перейти к следующему пункту 🙂
Atom - удобный, интересный, расширяемый текстовый редактор кода. Очень похож на VSCode, если честно. Бесплатный.


Brackets - все аналогично 🙂

Sublime⦁	 ⦁	Text - некоторые разработчики считают его немного морально устаревшим, хотя по функционалу не уступает своим братьям выше. Есть возможность приобрести платную подписку или использовать бесплатно.
Vim - специфический редактор, который по душе уже бородатым программистам. Сначала стоит прочитать по нему гайды, прежде чем выбирать его. Бесплатный.
WebStorm - полноценная IDE, то есть среда разработки со всем необходимым. Содержит много всего и новичку это может показаться излишним. Из-за этого может и медленно работать на слабых компьютерах. Платная, но есть 30-дневный пробный период и различные бесплатные доступы для студентов (ищите варианты в интернете)
Остальные либо поддерживаются на какой-то определенной операционной системе, либо заточены под определенный другой язык программирования. Так что эти самые популярные, используемые, обновляемые и поддерживаются на всех системах.


Учебники

Каждый из нас усваивает информацию по разному. Это из-за особенностей зрительной, слуховой или других видов памяти. Кому-то продуктивнее читать, а потом закреплять информацию видеороликом. Кому-то наоборот, кому-то достаточно урока. Все варианты - это норма. Мы здесь для того, чтобы учиться и освоить определенные навыки, так что все средства хороши.
В уроках будут множество ссылок на дополнительные статьи, документации и тп, но и хорошим дополнением будут учебники. Вы должны понимать, что большинство из них не нацелены на реальную практику. Но дополнительно к видеоурокам там можно закрепить теорию. (В любом случае, вы и так узнаете всю необходимую информацию). Какие из учебников можно рассмотреть:
Современный учебник ⦁	JavaScript - это веб-учебник, который был переведен с английского на многие языки. Абсолютно бесплатный в формате сайта.
От себя должен сказать, что до последней редакции он мне не очень нравился. Многие моменты были не понятны со стороны новичка, некоторые темы были в неправильном порядке. Но последнее обновление вышло очень подробным и хорошо описывает некоторые детали. Иногда даже слишком подробно.

Из минусов могу отметить разделение учебника на три части: язык js, браузер и отдельные темы. Новичку совершенно не понятно как они связаны, и пока человек пройдет первый раздел - он может уже все бросить так и не дойдя до сути. Многие темы нужно комбинировать и давать в определенном порядке, чтобы сразу видеть результат своей работы.
Ну и то, что почти каждая тема - это отдельный кусок кода, все в месте которые они не складываются в один полноценный проект для практики.

Поэтому вы смело можете открывать отдельные темы в нем, которые мы будем проходить, смотреть там дополнительные примеры и тп. Но читать темы подряд может быть затруднительно.


⦁	Книга "JavaScript. Полное руководство", Флэнаган Дэвид

Хороший, большой и платный учебник. Тут хорошо выстроена программа, много примеров и намного больше информации. Иногда даже слишком много и нужно её фильтровать. Ведь все 722 страницы запомнить нереально 🙂
Важно! Нужно брать самое последнее издание учебника. Сейчас это 7е издание 2021го года. В нем все самые последние нововведения языка.
P.S. У меня, автора этого курса на полке лежит как раз такая, только 6е издание.
Серия книг «⦁	You⦁	 ⦁	Don’t⦁	 ⦁	Know⦁	 JS» - подойдет как начинающим, так разработчикам среднего уровня. Я приложил ссылку на перевод, но есть и в оригинале. Книга написана больше в авторском стиле. Не как учебник, а как именно книга. Так что можно читать её в любой момент времени. Допустим, после прохождения определенных уроков.
Выразительный ⦁	Javascript - не для новичков, буду говорить честно, но интересная практическая книга. Можете взять её на заметку. Второе издание с переводом в открытом доступе по ссылке.


⦁	«JavaScript. Шаблоны» Стоян Стефанов - Очень полезная книга для выхода на следующий уровень, не для новичков. Рекомендую на будущее.

⦁	Разные дополнительные полезные вещи я периодически размещаю в своем телеграм-канале по хэштэгу #полезности и другим. Там тоже можно подчерпнуть информацию для новичков.
Перед обучением
Потратьте минут 5 на прочтение небольшой вводной главы одного из учебников выше по этой ссылке: тут
Она действительно хороша.
Если вам тяжело ..., не нужно думать о себе плохо. С вами всё в порядке – вам нужно просто продолжать движение. Сделайте перерыв, вернитесь назад – и всегда удостоверяйтесь, что вы прочли и поняли примеры программ. Обучение – это сложная работа, но раз вы что-то выучили, оно уже принадлежит вам, и облегчает дальнейшие шаги.




О программировании

Я не просвещаю тех, кто не жаждет учиться, и не побуждаю тех, кто не хочет искать ответы самостоятельно. Если я покажу один угол квадрата, и они не приходят ко мне с остальными тремя – мне не нужно давать повторных объяснений.
Конфуций

Кроме объяснения JavaScript я также хочу объяснить основные принципы программирования. Как выясняется, программировать тяжело. Обычно базовые принципы просты и понятны. Но программы, построенные на этих принципах, становятся сложными настолько, что вводят свои собственные правила и уровни сложности. Вы строите свой собственный лабиринт, и можете в нём потеряться.

Возможно, временами чтение будет разочаровывать вас. Если вы новичок в программировании, вам нужно будет много чего переварить. Много материала будет скомбинировано таким образом, что вам нужно будет установить новые связи между его частями.
Вы сами должны обосновать необходимость этих усилий. Если вам тяжело продираться через книгу, не нужно думать о себе плохо. С вами всё в порядке – вам нужно просто продолжать движение. Сделайте перерыв, вернитесь назад – и всегда удостоверяйтесь, что вы прочли и поняли примеры программ. Обучение – это сложная работа, но раз вы что-то выучили, оно уже принадлежит вам, и облегчает дальнейшие шаги.
Программист создаёт вселенные, за которые он один в ответе. В компьютерных программах могут быть созданы вселенные практически неограниченной сложности.
Джозеф Вайзенбаум, «Сила компьютеров и Разум людей»

Программа – сложное понятие. Это кусок текста, набранный программистом, это направляющая сила, заставляющая компьютер что-то делать, это данные в памяти компьютера, и при этом она контролирует работу с этой же самой памятью. Аналогии, которые пытаются сравнивать программы со знакомыми нам объектами обычно не справляются с этим. Одна более-менее подходящая – аналогия с машиной. Множество отдельных частей составляют одно целое, и чтобы заставить её работать, нам нужно представлять себе способы, которыми эти части взаимодействуют и что они привносят в работу целой машины.
Компьютер – это машина, которая устроена так, чтобы содержать в себе эти нематериальные машинки. Компьютеры сами по себе могут выполнять только простые действия. Польза их в том, что они могут делать это очень быстро. Программа может очень хитрым образом комбинировать эти действия так, чтобы в результате выполнялись очень сложные действия.
Для некоторых из нас программирование – это увлекательная игра. Программа – это мысленная конструкция. Ничего не стоит её построить, она ничего не весит, и она легко вырастает под нашими пальцами.

Если не быть осторожным, размер и сложность выходят из-под контроля, запутывая даже того, кто её пишет. Это основная проблема программирования: сохранять контроль над программами. Когда программа работает – это прекрасно. Искусство программирования – это умение контролировать сложность. Большая программа находится под контролем, и выполнена просто в своей сложности.

Многие программисты верят, что этой сложностью лучше всего управлять, используя в программах небольшой набор хорошо известных техник. Они описали строгие правила («наилучшие практики») того, какую форму программы должны иметь. И самые ревностные среди них считают тех, кто отклоняется от этих практик, плохими программистами.
Что за враждебность по отношению к богатству программирования – попытки принизить его до чего-то прямолинейного и предсказуемого, наложить табу на всякие странные и прекрасные программы! Ландшафт техник программирования огромен, увлекателен своим разнообразием, и до сих пор изучен мало. Это опасное путешествие, заманивающее и запутывающее неопытного программиста, но это всего лишь означает, что вы должны следовать этим путём осторожно и думать головой. По мере обучения вам всегда будут встречаться новые задачи и новые неизведанные территории. Программисты, не изучающие новое, стагнируют, забывают свою радость, их работа наскучивает им.
Почему язык имеет значение


В начале, при зарождении компьютерных дисциплин, не было языков программирования. Программы выглядели так:
00110001 00000000 00000000
00110001 00000001 00000001
00110011 00000001 00000010
01010001 00001011 00000010
00100010 00000010 00001000
01000011 00000001 00000000
01000001 00000001 00000001
00010000 00000010 00000000
01100010 00000000 00000000


Это программа, складывающая числа от 1 до 10, и выводящая результат (1 + 2 +… + 10 = 55). Она может выполняться на очень простой гипотетической машине. Для программирования первых компьютеров было необходимо устанавливать большие массивы переключателей в нужные позиции, или пробивать дырки в перфокартах и скармливать их компьютеру. Можете представить, какая это была утомительная, подверженная ошибкам процедура. Написание даже простых программ требовало большого ума и дисциплины. Сложные программы были практически немыслимы.


Конечно, ручной ввод этих мистических диаграмм бит (нулей и единиц) давал программисту возможность ощутить себя волшебником. И это чего-то стоило в смысле удовлетворения работой.


Каждая строка указанной программы содержит одну инструкцию. На обычном языке их можно описать так:
1. записать 0 в ячейку памяти 0
2. записать 1 в ячейку памяти 1
3. записать значение ячейки 1 в ячейку 2
4. вычесть 11 из значения ячейки 2
5. если у ячейки 2 значение 0, тогда продолжить с пункта 9.
6. добавить значение ячейки 1 к ячейке 0
7. добавить 1 к ячейке 1
8. продолжить с пункта 3.
9. вывести значение ячейки 0


Этот вариант легче прочесть, чем кучу бит, но он всё равно не очень удобен. Использование имён вместо номеров инструкций и ячеек памяти может улучшить понимание.
  установить ‘total’ в 0
  установить ‘count’ в 1

  [loop]

  установить ‘compare’ в ‘count’
  вычесть 11 из ‘compare’
  если ‘compare’ равно нулю, перейти на [end]
  добавить ‘count’ к ‘total’
  добавить 1 к ‘count’
  перейти на [loop]

  [end]

  вывести ‘total’


Вот теперь уже не так сложно понять, как работает программа. Справитесь? Первые две строки назначают двум областям памяти начальные значения. total будет использоваться для подсчёта результата вычисления, а count будет следить за числом, с которым мы работаем в данный момент. Строчки, использующие ‘compare’, наверно, самые странные. Программе нужно понять, не равно ли count 11, чтобы прекратить подсчёт. Так как наша воображаемая машина довольно примитивна, она может только выполнить проверку на равенство переменной нулю, и принять решение о том, надо ли перепрыгнуть на другую строку. Поэтому она использует область памяти под названием ‘compare’, чтобы подсчитать значение count – 11 и принять решение на основании этого значения. Следующие две строки добавляют значение count в счетчик результата и увеличивают count на 1 каждый раз, когда программа решает, что ещё не достигла значения 11.


Вот та же программа на JavaScript:
var total = 0, count = 1;
while (count <= 10) {
  total += count;
  count += 1;
}
console.log(total);
// → 55


Еще несколько улучшений. Главное – нет необходимости вручную обозначать переходы между строками. Конструкция языка while делает это сама. Она продолжает вычислять блок, заключённый в фигурные скобки, пока условие выполняется (count <=10), то есть значение count меньше или равно 10. Уже не нужно создавать временное значение и сравнивать его с нулём. Это было скучно, и сила языков программирования в том, что они помогают избавиться от скучных деталей.
В конце программы по завершению while к результату применяется операция console.log с целью вывода.
И наконец, вот так могла бы выглядеть программа, если б у нас были удобные операции range и sum, которые, соответственно, создавали бы набор номеров в заданном промежутке и подсчитывали сумму набора:
console.log(sum(range(1, 10)));
// → 55


Мораль сей басни – одна и та же программа может быть написана и долго, и коротко, читаемо и нечитаемо. Первая версия программы была совершенно смутной, а последняя – почти настоящий язык – записать сумму диапазона номеров от 1 до 10. В следующих главах мы рассмотрим, как делать такие вещи.
Хороший язык программирования помогает программисту сообщать компьютеру о необходимых операциях на высоком уровне. Позволяет опускать скучные детали, даёт удобные строительные блоки (while и console.log), позволяет создавать свои собственные блоки (sum и range), и делает простым комбинирование блоков.
Что такое JavaScript?


JavaScript был представлен в 1995 году как способ добавлять программы на веб-страницы в браузере Netscape Navigator. С тех пор язык прижился во всех основных графических браузерах. Он дал возможность появиться современным веб-приложениям – браузерные е-мейл-клиенты, карты, социальные сети. А ещё он используется на более традиционных сайтах для обеспечения интерактивности и всяких наворотов.
Важно отметить, что JavaScript практически не имеет отношения к другому языку под названием Java. Похожее имя было выбрано из маркетинговых соображений. Когда появился JavaScript, язык Java широко рекламировался и набирал популярность. Кое-кто решил, что неплохо бы прицепиться к этому паровозу. А теперь мы уже никуда не денемся от этого имени.


После того, как язык вышел за пределы Netscape, был составлен документ, описывающий работу языка, чтобы разные программы, заявляющие о его поддержке, работали одинаково. Он называется стандарт ECMAScript по имени организации ECMA. На практике можно говорить о ECMAScript и JavaScript как об одном и том же.
Многие ругают JavaScript и говорят о нём много плохого. И многое из этого – правда. Когда мне первый раз пришлось писать программу на JavaScript, я быстро почувствовал отвращение – язык принимал практически всё, что я писал, при этом интерпретировал это вовсе не так, как я подразумевал. В основном это было из-за того, что я не имел понятия о том, что делаю, но тут есть и проблема: JavaScript слишком либерален. Задумывалось это как облегчение программирования для начинающих. В реальности, это затрудняет розыск проблем в программе, потому что система о них не сообщает.


Гибкость имеет свои преимущества. Она оставляет место для разных техник, невозможных в более строгих языках. Иногда, как мы увидим в главе «модули», её можно использовать для преодоления некоторых недостатков языка. После того, как я по-настоящему изучил и поработал с ним, я научился любить JavaScript.
Вышло уже несколько версий языка JavaScript. ECMAScript 3 была доминирующей, распространённой версией во время подъёма языка, примерно с 2000 до 2010. В это время готовилась амбициозная 4-я версия, в которой было запланировано несколько радикальных улучшений и расширений языка. Однако политические причины сделали изменение живого популярного языка очень сложным, и работа над 4-й версией была прекращена в 2008. Вместо неё вышла менее амбициозная 5-я версия в 2009. Сейчас большинство браузеров поддерживает 5-ю версию, которую мы и будем использовать в книге.


JavaScript поддерживают не только браузеры. Базы данных типа MongoDB and CouchDB используют его в качестве скриптового языка и языка запросов. Есть несколько платформ для декстопов и серверов, наиболее известная из которых Node.js, предоставляющие мощное окружение для программирования вне браузера.
Код, и что с ним делать


Код – это текст, из которого состоят программы. В большинстве глав книги есть код. Чтение и написание кода – это неотъемлемая часть обучения программированию. Старайтесь не просто пробегать глазами примеры – читайте их внимательно и разбирайтесь. Сначала это будет происходить медленно и непонятно, но вы быстро овладеете навыками. То же – насчёт упражнений. Не подразумевайте, что вы в них разобрались, пока не напишете работающий вариант.


Рекомендую пробовать ваши решения в настоящем интерпретаторе языка, чтобы сразу получать отзыв, и, надеюсь, подвергаться искушению поэкспериментировать далее.
Вы можете установить Node.js и выполнять программы с его помощью. Также вы можете делать это в консоли браузера. В 12 главе будет объяснено, как встраивать программы в HTML-страницы. Также есть сайты типа jsbin.com, позволяющие просто запускать программы в браузере. На сайте книги есть песочница для кода.


 */